[
  {
    "_id": "62b098d4ef240b021619824f",
    "name": "Scott Harris 440",
    "slug": "Glasses 1",
    "image": "https://project3inc.s3.us-west-2.amazonaws.com/ccf233067af8526a88356d079ca49199.jpg",
    "imageS3Key": "ccf233067af8526a88356d079ca49199.jpg",
    "images": [
      "https://project3inc.s3.us-west-2.amazonaws.com/5ff16dd556713c58839476ed0ab1d84f.jpg"
    ],
    "additionalS3": ["5ff16dd556713c58839476ed0ab1d84f.jpg"],
    "brand": "Scott Harris",
    "category": "Round",
    "lensWidth": 53,
    "lensHeight": 36,
    "bridge": 17,
    "lensDiagonal": 56,
    "templeLength": 135,
    "eyeRatio": 2.4836,
    "earFaceRatio": 1.1581,
    "cheekChinRatio": 0.7601,
    "noseRatio": 1.9322,
    "frameColor": "Purple",
    "prescriptionMin": 1,
    "prescriptionMax": 8,
    "description": "The Scott Harris Eyewear collection is a diverse collection that features both traditional, unisex styling and the ultimate in high fashion designs for those seeking a unique look. Every model of Scott Harris eyeglasses are constructed from the finest components available, including spring hinges from Germany and Japan, and a wide array of base metals from Japan.  Within the Scott Harris collection are styles made of stainless steel, cobalt, and titanium. All three of these materials have various features and benefits, which gives the consumer the opportunity to select not only the fashion they want, but the material that best fits their needs.",
    "price": 120,
    "countInStock": 10,
    "rating": 5,
    "numReviews": 1,
    "reviews": [
      {
        "name": "admin",
        "comment": "kool",
        "rating": 5,
        "_id": "62b152a9eed7f48b9b7f05dc",
        "createdAt": "2022-06-21T05:10:01.300Z",
        "updatedAt": "2022-06-21T05:10:01.300Z"
      }
    ],
    "createdAt": "2022-06-20T15:57:08.273Z",
    "updatedAt": "2022-06-21T17:16:42.967Z",
    "__v": 4
  },
  {
    "_id": "62b0c0b54198c9c0347b147a",
    "name": "Levi's LS123",
    "slug": "Glasses 2",
    "image": "https://project3inc.s3.us-west-2.amazonaws.com/dcddb3ed5f4baf7dcb3642687f72911f.jpg",
    "imageS3Key": "dcddb3ed5f4baf7dcb3642687f72911f.jpg",
    "images": [
      "https://project3inc.s3.us-west-2.amazonaws.com/7f87cd2f055333c568347d2f51424e6c.jpg"
    ],
    "additionalS3": ["7f87cd2f055333c568347d2f51424e6c.jpg"],
    "brand": "Levi's",
    "category": "Oval",
    "lensWidth": 54,
    "lensHeight": 43,
    "bridge": 20,
    "lensDiagonal": 0,
    "templeLength": 145,
    "eyeRatio": 2.274,
    "earFaceRatio": 1.2698,
    "cheekChinRatio": 0.8955,
    "noseRatio": 2.2307,
    "frameColor": "Grey",
    "prescriptionMin": 0,
    "prescriptionMax": 9,
    "description": "Stylish, Casual, and functional, The Levis LS123 are worthy to be a part of your collection. 70% off Retail price for prescription glasses, sunglasses and sports glasses. The Levis LS123 prescription Eyeglasses for Men made of Plastic features Square shape with color. You can get Levis LS123 Full rim for Men from Glasses Gallery at unbeatable price. Available in many colors, the Levis LS123 prescription Eyeglasses made of Plastic in Square shape will always look stylish. The Levis Eyeglasses is available in different lenses such as clear prescription lenses, bifocal or progressive lenses, transitions lenses and polarized lenses. You may add a digital block coating to protect your eyes. Glasses Gallery offers a 12-month warranty, 14-day return and best price guarantee for every purchase.",
    "price": 130,
    "countInStock": 5,
    "rating": 0,
    "numReviews": 0,
    "reviews": [],
    "createdAt": "2022-06-20T18:47:17.792Z",
    "updatedAt": "2022-06-21T18:14:47.513Z",
    "__v": 3
  },
  {
    "_id": "62b0c2144198c9c0347b1483",
    "name": "Modz Kids Wagon",
    "slug": "Glasses 3",
    "image": "https://project3inc.s3.us-west-2.amazonaws.com/28555795e081d2c08a467d9bd8b1029a.jpg",
    "imageS3Key": "28555795e081d2c08a467d9bd8b1029a.jpg",
    "images": [
      "https://project3inc.s3.us-west-2.amazonaws.com/d2c169f42b093ae2f24f2e5e67a27d2e.jpg"
    ],
    "additionalS3": ["d2c169f42b093ae2f24f2e5e67a27d2e.jpg"],
    "brand": "Modz Kids",
    "category": "Rectangle",
    "lensWidth": 48,
    "lensHeight": 29,
    "bridge": 15,
    "lensDiagonal": 48.7,
    "templeLength": 125,
    "eyeRatio": 2.4132,
    "earFaceRatio": 1.0822,
    "cheekChinRatio": 0.8577,
    "noseRatio": 1.9868,
    "frameColor": "Blue",
    "prescriptionMin": 2,
    "prescriptionMax": 7,
    "description": "The Modz Kids Wagon Eyeglasses by Modz Kids has many marvelous features. The eyesize of this item is 46 millimeters. This eyewear is eligible for prescription lens installation. Being designed specifically for younger boys due to its smaller than usual size or its fun boyish style and color variations. the color of passionate love, seduction, violence, danger, anger, and adventure. Black is the most common color seen in the dark. The length of the temple pieces are 125 millimeters. The width of the bridge of this frame is 15 millimeters. It’s nature’s color for water and sky. Item ranges in price between $30 and $60. It is fully rimmed along the edges to give a sense of completeness, lens security, toleration and absolute style. The rectangle shape helps draw more emphasis to your rounded facial features. Crafted from plastic and carefully constructed to display a bold look and stylish flair. If you're concerned about sun protection, you are able to add custom polarized or non-polarized clip-on sunglasses to these frames. If you're looking for something that's compatible with bi-focal or progressive lenses, then you've found it.  The Modz Kids Wagon Eyeglasses is found in the Eyeglasses category and is offered in marvelous option(s). Color Black/Blue Matte,Color Black/Lime Matte,Color Black/Red Matte,Size 46 - 15 ¬ 125.",
    "price": 100,
    "countInStock": 3,
    "rating": 0,
    "numReviews": 0,
    "reviews": [],
    "createdAt": "2022-06-20T18:53:08.999Z",
    "updatedAt": "2022-06-21T18:21:18.726Z",
    "__v": 3
  },
  {
    "_id": "62b0c2ad4198c9c0347b148a",
    "name": "Brooks Brothers 0BB4040S",
    "slug": "Glasse 4",
    "image": "https://project3inc.s3.us-west-2.amazonaws.com/00a236c95b3218d58a64cfed37aa2d02.jpg",
    "imageS3Key": "00a236c95b3218d58a64cfed37aa2d02.jpg",
    "images": [
      "https://project3inc.s3.us-west-2.amazonaws.com/d5e8dd34a64ab4eb44890834b14e2bfc.jpg"
    ],
    "additionalS3": ["d5e8dd34a64ab4eb44890834b14e2bfc.jpg"],
    "brand": "Brooks Brothers",
    "category": "Rectangle",
    "lensWidth": 59,
    "lensHeight": 42,
    "bridge": 15,
    "lensDiagonal": 62.9,
    "templeLength": 140,
    "eyeRatio": 2.3881,
    "earFaceRatio": 1.1532,
    "cheekChinRatio": 0.7524,
    "noseRatio": 2.0369,
    "frameColor": "Grey",
    "prescriptionMin": 0,
    "prescriptionMax": 10,
    "description": "The Brooks Brothers BB 4040S is a perfect choice of Sunglasses from the remarkable Brooks Brothers collection. These exciting Sunglasses have a compelling arrangement of remarkable features. If you're looking for something masculine, look no further. These frames are specifically designed for men. Item ranges in price between $60 and $100. Black is the most common color seen in the dark. This eyewear is eligible for prescription lens installation. between black and white in color. If you're looking for something that's compatible with bi-focal or progressive lenses, then you've found it. A shade of dark yellow, when gray or black is added to it. The length of the temple pieces are 140 millimeters. Composed of metal like nickel, monel or stainless steel to help give some durability and relative overall strength. It is fully rimmed along the edges to give a sense of completeness, lens security, toleration and absolute style. Bright yellow in color The eyesize of this item is 59 millimeters. Is an intermediate color between black and white. The dappled amber tones of tortoiseshell have timeless class. The width of the bridge of this frame is 15 millimeters..  By looking at the Brooks Brothers BB 4040S you can tell Brooks Brothers does a fantastic job in revealing all the great qualities in these Mens Sunglasses. The various traits distinctively found adorned all throughout the Brooks Brothers BB 4040S are truly fascinating. The different options available for the Brooks Brothers BB 4040S exist to suite those looking for Sunglasses specifically made for the right style and physical features; Color 167487 Matte Black/Black Horn / Grey Solid,Color 167573 Antique Gold/Dark Tort / Olive Solid (Discontinued),Color 16733 Lt. Gunmetal/Retro Tort / Grey Solid (Discontinued),Size 59-15-140.  Feel at ease buying Brooks Brothers BB 4040S from an online authorized reseller of Brooks Brothers. These Sunglasses made by Brooks Brothers are brand new & 100% authentic and carry a one year minimum warranty. Get your own Brooks Brothers BB 4040S today.",
    "price": 140,
    "countInStock": 5,
    "rating": 0,
    "numReviews": 0,
    "reviews": [],
    "createdAt": "2022-06-20T18:55:41.967Z",
    "updatedAt": "2022-06-21T18:47:15.945Z",
    "__v": 3
  },
  {
    "_id": "62b1709474bd6fe7608f31c5",
    "name": "Michael Kors 0MK1056",
    "slug": "Glasses 5",
    "image": "https://project3inc.s3.us-west-2.amazonaws.com/f51a1f2def8d9ac37898fbf71bfa0e0a.jpg",
    "imageS3Key": "f51a1f2def8d9ac37898fbf71bfa0e0a.jpg",
    "images": [
      "https://project3inc.s3.us-west-2.amazonaws.com/da3a114d5871312028cc0172971d6449.jpg"
    ],
    "additionalS3": [
      "a2def5997a34af9b61844d6271a99e42.jpg",
      "00a9175d2dcbb29efd6c80bc92cafb37.jpg",
      "c7d7f1b4386c5bcb17b0a9f8414a078a.jpg",
      "420028bbdb25908b0abbc3b0e69c92a3.jpg",
      "da3a114d5871312028cc0172971d6449.jpg"
    ],
    "brand": "Michael Kors",
    "category": "Aviator",
    "lensWidth": 58,
    "lensHeight": 48,
    "bridge": 15,
    "lensDiagonal": 63.8,
    "templeLength": 140,
    "eyeRatio": 2.4372,
    "earFaceRatio": 1.2571,
    "cheekChinRatio": 0.7567,
    "noseRatio": 1.8846,
    "frameColor": "Black",
    "prescriptionMin": 0,
    "prescriptionMax": 10,
    "description": "The Michael Kors MK1056 BARCELONA is a perfect choice of Sunglasses from the wonderful Michael Kors collection. These exciting Sunglasses have a compelling arrangement of wonderful features. The width of the bridge of this frame is 15 millimeters. Polarized lenses remove nearly 100% of surface glare from the environment around you, and are highly recommended for all outdoor activities. between black and white in color. Usually paired with polarized lenses, mirror coatings come in a variety of colors. Their highly reflective properties reflect heat, glare, and can enhance visual comfort. You can't go wrong with this classic aviator shape. Black is the most common color seen in the dark. Get down-to-earth when you use brown colors. The length of the temple pieces are 140 millimeters. Gradient tint is a fashionable selection which starts out dark at the top and gradually lightens towards the bottom of the sunglass lenses. Normally white light is considered to have all wavelengths (colors) of light in it. It’s nature’s color for water and sky. This eyewear is eligible for prescription lens installation. a combination of the color red and white, a hue that can be described as a tint Metallic gray but livelier, more playful. The eyesize of this item is 58 millimeters. Item ranges in price between $60 and $100. It is fully rimmed along the edges to give a sense of completeness, lens security, toleration and absolute style. Composed of metal like nickel, monel or stainless steel to help give some durability and relative overall strength. If you're looking for something feminine, look no further. These frames are specifically designed for women. If you're looking for something that's compatible with bi-focal or progressive lenses, then you've found it. Bright yellow in color This color offers a range of reds and light to dark pink hues.  By looking at the Michael Kors MK1056 BARCELONA you can tell Michael Kors does a fantastic job in revealing all the great qualities in these Womens Sunglasses. The various traits distinctively found adorned all throughout the Michael Kors MK1056 BARCELONA are truly fascinating. The different options available for the Michael Kors MK1056 BARCELONA exist to suite those looking for Sunglasses specifically made for the right style and physical features; Color 10147H Light Gold / Silver Acorn Gradient Mirror (Discontinued),Color 101487 Light Gold / Dark Grey Solid,Color 10148G Light Gold / Dark Grey Gradient (Discontinued),Color 108287 Shiny Black / Dark Grey Solid (Discontinued),Color 11084Z Rose Gold / Rose Gold Mirror (Discontinued),Color 110867 Rose Gold / Black Magenta Gradient Mirror,Color 1213V0 Brown Mink / Brown Clear Gradient (Discontinued),Color 10016Q Geranium / Geranium Mirror,Color 1002Y7 Crew Blue / Crew Blue Mirror (Discontinued),Color 10032Y Mimosa / Golden Rod Mirror,Color 10026G Rose Gold / Silver Mirror,Color 1003D0 Cordovan / Cordovan Mirror,Color 11082T Rose Gold / Rose Gold Polar (Discontinued),Color 101481 Light Gold / Dark Grey Polar,Size 58-15-140.  Feel at ease buying Michael Kors MK1056 BARCELONA from an online authorized reseller of Michael Kors. These Sunglasses made by Michael Kors are brand new & 100% authentic and carry a one year minimum warranty. Get your own Michael Kors MK1056 BARCELONA today.",
    "price": 210,
    "countInStock": 18,
    "rating": 0,
    "numReviews": 0,
    "reviews": [],
    "createdAt": "2022-06-21T07:17:40.480Z",
    "updatedAt": "2022-06-21T17:13:03.551Z",
    "__v": 5
  },
  {
    "_id": "62b1f6928076d777badf7cab",
    "name": "Puma PU0051O",
    "slug": "Glasses 6",
    "image": "https://project3inc.s3.us-west-2.amazonaws.com/916dea76b8fe862f721f484a3a5e3a6c.jpg",
    "imageS3Key": "916dea76b8fe862f721f484a3a5e3a6c.jpg",
    "images": [],
    "additionalS3": [],
    "brand": "Puma",
    "category": "Rectangle",
    "lensWidth": 54,
    "lensHeight": 41.9,
    "bridge": 18,
    "lensDiagonal": 61.1,
    "templeLength": 140,
    "eyeRatio": 2.3847,
    "earFaceRatio": 1.2567,
    "cheekChinRatio": 0.7788,
    "noseRatio": 2.1247,
    "frameColor": "Brown",
    "prescriptionMin": 2,
    "prescriptionMax": 7,
    "description": "The Puma PU0051O is a perfect choice of Eyeglasses from the sensational Puma collection. These exciting Eyeglasses have a compelling arrangement of sensational features. .  By looking at the Puma PU0051O you can tell Puma does a fantastic job in revealing all the great qualities in these {tags:1} Eyeglasses. The various traits distinctively found adorned all throughout the Puma PU0051O are truly fascinating. The different options available for the Puma PU0051O exist to suite those looking for Eyeglasses specifically made for the right style and physical features; Color 001 Black,Color 002 Havana Grey,Color 004 Blue Green,Size 54 - 18 ¬ 140.  Feel at ease buying Puma PU0051O from an online authorized reseller of Puma. These Eyeglasses made by Puma are brand new & 100% authentic and carry a one year minimum warranty. Get your own Puma PU0051O today.",
    "price": 119,
    "countInStock": 20,
    "rating": 0,
    "numReviews": 0,
    "reviews": [],
    "createdAt": "2022-06-21T16:49:22.672Z",
    "updatedAt": "2022-06-21T16:57:02.021Z",
    "__v": 0
  },
  {
    "_id": "62b1fd2bd60e71fb156db943",
    "name": "Coach HC8263U",
    "slug": "Glasses 8",
    "image": "https://project3inc.s3.us-west-2.amazonaws.com/eb15b0f4d1b7057865a45b853b1674e2.jpg",
    "imageS3Key": "eb15b0f4d1b7057865a45b853b1674e2.jpg",
    "images": [
      "https://project3inc.s3.us-west-2.amazonaws.com/093c506efa111b6eeb65ed46dc99fe27.jpg"
    ],
    "additionalS3": ["093c506efa111b6eeb65ed46dc99fe27.jpg"],
    "brand": "Coach",
    "category": "Round",
    "lensWidth": 55,
    "lensHeight": 50.6,
    "bridge": 17,
    "lensDiagonal": 57,
    "templeLength": 140,
    "eyeRatio": 2.0897,
    "earFaceRatio": 1.2618,
    "cheekChinRatio": 0.7698,
    "noseRatio": 1.9015,
    "frameColor": "Black",
    "prescriptionMin": 0,
    "prescriptionMax": 9,
    "description": "Coach Women's Oversize Square Sunglasses w/ Gradient Lens - HC8263U  This model from Coach features a glam, oversize square shape crafted from premium acetate with flowing, curved temples accentuated by floral design beside 'Coach' lettering. Features include a comfortable saddle bridge, flowing, steel hinges and gradient lenses that provide 100% UV protection from the sun's harmful rays.  Guaranteed brand new and authentic Includes storage case and cleaning cloth Lens Technology: Gradient Frame Material: Acetate Protection: 100% UV Rx-able Lens Width: 55mm Bridge Width: 17mm Temple Length: 140mm",
    "price": 59.99,
    "countInStock": 1,
    "rating": 0,
    "numReviews": 0,
    "reviews": [],
    "createdAt": "2022-06-21T17:17:31.151Z",
    "updatedAt": "2022-06-21T17:35:42.639Z",
    "__v": 1
  },
  {
    "_id": "62b201fed60e71fb156db94a",
    "name": "Coach HC6119",
    "slug": "Glasses 9",
    "image": "https://project3inc.s3.us-west-2.amazonaws.com/2c054cb0519e33b9caa2d203c3e9d949.jpg",
    "imageS3Key": "2c054cb0519e33b9caa2d203c3e9d949.jpg",
    "images": [
      "https://project3inc.s3.us-west-2.amazonaws.com/e6ca0f9c9ba7a465a32bb6031ff63e80.jpg"
    ],
    "additionalS3": ["e6ca0f9c9ba7a465a32bb6031ff63e80.jpg"],
    "brand": "Coach",
    "category": "Rectangle",
    "lensWidth": 46.8,
    "lensHeight": 29.2,
    "bridge": 16,
    "lensDiagonal": 48.7,
    "templeLength": 130,
    "eyeRatio": 2.3786,
    "earFaceRatio": 1.1987,
    "cheekChinRatio": 0.7553,
    "noseRatio": 2.16,
    "frameColor": "Grey",
    "prescriptionMin": 2,
    "prescriptionMax": 10,
    "description": "Flaunt your style wearing Coach HC6119 eyeglasses. These classic full-rim, rectangular frames present a polished and professional profile, with color and pattern options that fill them with nuance and personality. Coach crafts these glasses in acetate, an eco-friendly material produced of plant fibers and plasticizers. Acetate comes in an enormous variety of colors, textures, and patterns–and because it’s also lightweight and comfortable, yet strong and durable, it's easy to see why this material is a popular choice for designer glasses. An eye-catching “C” emblem at the temple ends adds to the structure of the frames, with the Coach name printed in small caps beside it. Stake out your style when you step out in these Coach glasses.  Full-rim, rectangular frames are polished and professional Acetate frames are lightweight yet strong Frames feature eye-catching Coach \"C\" design element at temple ends About Coach Eyewear Women’s designer eyewear by Coach exudes a distinctive big-city vibe in chic frames that blend modern sophistication with vintage-inspired style. The result is a collection of daring luxury eyewear that complements a wide range of wardrobes. Browse oversized frames in bold colors, or sleek silhouettes in subtle neutral hues. Coach uses modern color palettes in two-tone frames, but also includes the classics, drawing inspiration from vintage eyewear styles in black or tortoiseshell to create elegant frames that appeal to contemporary tastes.",
    "price": 203,
    "countInStock": 19,
    "rating": 0,
    "numReviews": 0,
    "reviews": [],
    "createdAt": "2022-06-21T17:38:06.159Z",
    "updatedAt": "2022-06-21T17:42:21.249Z",
    "__v": 1
  },
  {
    "_id": "62b20312d60e71fb156db953",
    "name": "ModZ Kids Tumble",
    "slug": "Glasses 10",
    "image": "https://project3inc.s3.us-west-2.amazonaws.com/07543cc1caf0f5280e84c792fa059705.jpg",
    "imageS3Key": "07543cc1caf0f5280e84c792fa059705.jpg",
    "images": [
      "https://project3inc.s3.us-west-2.amazonaws.com/ce45e245eaa071f7cbf141fe731accf5.jpg"
    ],
    "additionalS3": ["ce45e245eaa071f7cbf141fe731accf5.jpg"],
    "brand": "ModZ Kids",
    "category": "Rectangle",
    "lensWidth": 46.8,
    "lensHeight": 29.2,
    "bridge": 16,
    "lensDiagonal": 48.7,
    "templeLength": 130,
    "eyeRatio": 2.1103,
    "earFaceRatio": 1.2603,
    "cheekChinRatio": 0.7584,
    "noseRatio": 2.1184,
    "frameColor": "Red",
    "prescriptionMin": 2,
    "prescriptionMax": 10,
    "description": "This frame will not accommodate single vision, progressive lenses or bifocal lenses. These designer prescription glasses are made to accommodate most prescription lenses. Made of plastic, otherwise known as cellulose acetate, or zyl, the frame can be easily adjusted for a perfect fit with your prescription lenses. Your frame purchase includes free standard shipping charges, and manufacturer packaging. You can add doctor verified prescription lenses, add custom polarized lenses, and many other lens options if you desire them. Like all ModZ Kids products, the ModZ Kids Tumble provides the sophisticated and classic look that we all need. ModZ Kids Tumble frames have a oval shape, which helps to balance rectangular facial features. Frame shape is the most noticeable feature of a pair of glasses, followed by frame color and frame size. Top brands always have a large collection of rectangle frame shape glasses, as well as oval frame shape glasses. ModZ Kids Tumble frames feature a fashionable full frame design, which is the largest component of designer eyeglasses brands collections. A rim all the way around the lenses, provides for maximum stability and durability. The frame has a Universal. Designed for children, this model has a Spring type hinge for greater comfort. Standard skull temples can be easily adjusted to fit perfectly behind your ears. This frame has a total width of 113mm. 2-year warranty. The warrantee by the manufacturer covers manufacturer's defects for the frame. As an online optical superstore, we can help to process a warrantee for you with the manufacturer, according to their return policy.",
    "price": 39,
    "countInStock": 14,
    "rating": 0,
    "numReviews": 0,
    "reviews": [],
    "createdAt": "2022-06-21T17:42:42.484Z",
    "updatedAt": "2022-06-21T17:58:47.364Z",
    "__v": 1
  }
]
